Revit 2026 API
SiteSubRegion Methods
The SiteSubRegion type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>) | Obsolete.
Create(Document, IList<CurveLoop>, ElementId) | Obsolete.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundary |  Gets the boundary of current subregion.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidBoundary
SetBoundary | Obsolete.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace